/*

 * A GENERAL_NOTE: the load functions in these classes take a byte array containing raw CAN buffer data.
 * The data contained in this byte array is used to populate the struct.
 *
 * A GENERAL_NOTE: The write functions in these classes take a byte array that is meant to be populated
 * with the data contained in the object. The byte array can then be used as the raw CAN buffer.
 *
 * TODO: If you make changes here, make sure to update https://hytechracing.me.gatech.edu/wiki/CAN_Data_Formats
 */

/**
 * IMPORTANT:
 * If you're adding more structs/functions to this, please follow the HEX order. I have rearranged the file to be
 * easier to read and add stuff to. Please don't change the order without a good reason. Add comments wherever you
 * believe is necessary. Better more comments than none.
 * 
 * CONVENTION:
 * Add a one-line comment containing the hex ID, name you used in the doc and the macro ID.
 * Do this for both the struct and the class.
 * Add the class/struct in the correct place.
 * 
 * TODO:
 * There is no information on: A8, A9, AF, DC, E1
 * 
 * OTHER:
 * D0 and D2 are obsolete. Check documentation for more info.
 * 
 * --Varnika/Vivacia/Meghavarnika Budati
 */

#ifndef __HYTECH_CAN_H__
#define __HYTECH_CAN_H__

#include <string.h>
#include <stdint.h>

/*
 * ECU state definitions // TODO make these enums?
 */
#define MCU_STATE_TRACTIVE_SYSTEM_NOT_ACTIVE 1
#define MCU_STATE_TRACTIVE_SYSTEM_ACTIVE 2
#define MCU_STATE_ENABLING_INVERTER 3
#define MCU_STATE_WAITING_READY_TO_DRIVE_SOUND 4
#define MCU_STATE_READY_TO_DRIVE 5

#define FCU_STATE_TRACTIVE_SYSTEM_NOT_ACTIVE 1
#define FCU_STATE_TRACTIVE_SYSTEM_ACTIVE 2
#define FCU_STATE_ENABLING_INVERTER 3
#define FCU_STATE_WAITING_READY_TO_DRIVE_SOUND 4
#define FCU_STATE_READY_TO_DRIVE 5

#define BMS_STATE_DISCHARGING 1
#define BMS_STATE_CHARGING 2
#define BMS_STATE_BALANCING 3
#define BMS_STATE_BALANCING_OVERHEATED 4

/**
 * CAN ID definitions
 * Refer to documentation for meaning of abbreviations/
 * general abbreviations used.
 */
#define MC_TEMP_1 0xA0
#define MC_TEMP_2 0xA1
#define MC_TEMP_3 0xA2
#define MC_A_INP_VOLT 0xA3
#define MC_D_INP_STAT 0xA4
#define MC_MOTOR_POS_INFO 0xA5
#define MC_CURR_INFO 0xA6
#define MC_VOLT_INFO 0xA7
#define MC_FLUX_INFO 0xA8               //UNKNOWN
#define MC_INT_INFO 0xA9                //UNKNOWN
#define MC_INT_STATES 0xAA
#define MC_FAULT_CODES 0xAB
#define MC_TOR_TIMER_INFO 0xAC
#define MC_MOD_INDEX_FLUX_WEAKENING_OUT_INFO 0xAD
#define MC_FIRM_INFO 0xAE
#define MC_DIAG_DATA 0xAF               //UNKNOWN
#define MC_COMM_MSG 0xC0
#define MC_RW_PARAM_COMM 0xC1
#define MC_RW_PARAM_RESP 0xC2
#define MCU_STAT 0xC3
#define MCU_PEDAL_READ 0xC4
#define GLV_CURR_READ 0xCC
#define FCU_READ 0xD3
#define BMS_ONB_TEMP 0xD5
#define BMS_ONB_DET_TEMP 0xD6           // TODO rename to bms_detailed_onboard_temperatures when we're not in the middle of a development cycle
#define BMS_VOLT 0xD7
#define BMS_DET_VOLT 0xD8
#define BMS_TEMP 0xD9
#define BMS_DET_TEMP 0xDA
#define BMS_STAT 0xDB
#define FH_WATCHDOG_TEST 0xDC           //UNKNOWN
#define CCU_STAT 0xDD
#define BMS_BAL_STAT 0xDE               // TODO rename to bms_balancing_cells when we're not in the middle of a development cycle
#define FCU_ACCEL 0xDF                  // TODO rename to mcu_accelerometer_readings when we're not in the middle of a development cycle
#define BMS_RW_PARAM_COMM 0xE0          // TODO define this message
#define BMS_PARAM_RESP 0xE1             //UNKNOWN
#define BMS_COUL_COUNTS 0xE2
#define MCU_GPS_READ_ALPHA 0xE7
#define MCU_GPS_READ_BETA 0xE8
#define MCU_GPS_READ_GAMMA 0xE9

// For compatibility with C.
#ifndef __cplusplus
#define bool char
#define true 1
#define false 0
#endif

/*
 * CAN message structs and classes
 */
#pragma pack(push,1)

//A0: Motor Controller Temperatur
typedef struct MCTemp1_t {
    int16_t module_a_temperature;
    int16_t module_b_temperature;
    int16_t module_c_temperature;
    int16_t gate_driver_board_temperature;
} MCTemp1_t;

//A1: Motor Controller Temperatures #2, MC_TEMP_2
typedef struct MCTemp2_t {
    int16_t control_board_temperature;
    int16_t rtd_1_temperature;
    int16_t rtd_2_temperature;
    int16_t rtd_3_temperature;
} MCTemp2_t;

//A2: Motor Controller Temperatures #3, MC_TEMP_3
typedef struct MCTemp3_t {
    int16_t rtd_4_temperature;
    int16_t rtd_5_temperature;
    int16_t motor_temperature;
    int16_t torque_shudder;
} MCTemp3_t;

//A3: MC Analog Inputs Voltages, MC_A_INP_VOLT
typedef struct MCAInpVolt_t {
    int16_t analog_input_1;
    int16_t analog_input_2;
    int16_t analog_input_3;
    int16_t analog_input_4;
} MCAInpVolt_t;

//A4: MC Digital Input Status, MC_D_INP_STAT
typedef struct MCDInpStat_t {
    bool digital_input_1;
    bool digital_input_2;
    bool digital_input_3;
    bool digital_input_4;
    bool digital_input_5;
    bool digital_input_6;
    bool digital_input_7;
    bool digital_input_8;
} MCDInpStat_t;

//A5: MC Motor Position Information, MC_MOTOR_POS_INFO
typedef struct MCMotorPosInfo_t {
    int16_t motor_angle;
    int16_t motor_speed;
    int16_t electrical_output_frequency;
    int16_t delta_resolver_filtered;
} MCMotorPosInfo_t;

//A6: MC Current Information, MC_CURR_INFO
typedef struct MCCurrInfo_t {
    int16_t phase_a_current;
    int16_t phase_b_current;
    int16_t phase_c_current;
    int16_t dc_bus_current;
} MCCurrInfo_t;

//A7: MC Voltage Information, MC_VOLT_INFO
typedef struct MCVoltInfo_t {
    int16_t dc_bus_voltage;
    int16_t output_voltage;
    int16_t phase_ab_voltage;
    int16_t phase_bc_voltage;
} MCVoltInfo_t;

//A8: MC Flux Information, MC_FLUX_INFO
// ???

//A9: MC Internal Voltages, MC_INT_INFO
//????

//AA: MC Internal States, MC_INT_STATES
typedef struct MCIntStates_t {
    uint16_t vsm_state;
    uint8_t inverter_state;
    uint8_t relay_state;
    uint8_t inverter_run_mode_discharge_state;
    uint8_t inverter_command_mode;
    uint8_t inverter_enable;
    uint8_t direction_command;
} MCIntStates_t;

//AB: MC Fault Codes, MC_FAULT_CODES
typedef struct MCFaultCodes_t {
    uint16_t post_fault_lo;
    uint16_t post_fault_hi;
    uint16_t run_fault_lo;
    uint16_t run_fault_hi;
} MCFaultCodes_t;

//AC: MC Torque Timer Information, MC_TOR_TIMER_INFO
typedef struct MCTorTimerInfo_t {
    int16_t commanded_torque;
    int16_t torque_feedback;
    uint32_t power_on_timer;
} MCTorTimerInfo_t;

//AD: MC Modulation Index Flux Weakening Output Information,
//MC_MOD_INDEX_FLUX_WEAKENING_OUT_INFO
typedef struct MCModIndexFluxWeakeningOutInfo_t {
    uint16_t modulation_index; // TODO Signed or Unsigned?
    int16_t flux_weakening_output;
    int16_t id_command;
    int16_t iq_command;
} MCModIndexFluxWeakeningOutInfo_t;

//AE: MC Firmware Information, MC_FIRM_INFO
typedef struct MCFirmInfo_t {
    uint16_t eeprom_version_project_code;
    uint16_t software_version;
    uint16_t date_code_mmdd;
    uint16_t date_code_yyyy;
} MCFirmInfo_t;

//AF: MC Diagnostic Data, MC_DIAG_DATA
// ???

//C0: MC Command Message, MC_COMM_MSG
typedef struct MCCommMsg_t {
    int16_t torque_command;
    int16_t angular_velocity;
    bool direction;
    uint8_t inverter_enable_discharge_enable;
    int16_t commanded_torque_limit;
} MCCommMsg_t;

//C1: MC Read/Write Parameter Command, MC_RW_PARAM_COMM
typedef struct MCRWParamComm_t {
    uint16_t parameter_address;
    bool rw_command;
    uint8_t reserved1;
    uint32_t data;
} MCRWParamComm_t;

//C2: MC Read/Write Parameter Response, MC_RW_PARAM_RESP
typedef struct MCRWParamResp_t {
    uint16_t parameter_address;
    bool write_success;
    uint8_t reserved1;
    uint32_t data;
} MCRWParamResp_t;

//C3: MCU_STAT
typedef struct MCUStat_t {
    uint8_t state;
    uint8_t flags;
    int16_t temperature;
    uint16_t glv_battery_voltage;
} MCUStat_t;

//C4: MCU_PEDAL_READ
typedef struct MCUPedalRead_t {
    uint16_t accelerator_pedal_raw_1;
    uint16_t accelerator_pedal_raw_2;
    uint16_t brake_pedal_raw;
    uint8_t pedal_flags;
    uint8_t torque_map_mode;
} MCUPedalRead_t;

//CC: GLV Current Readings, GLV_CURR_READ
typedef struct GLVCurrRead_t {
	uint16_t ecu_current_value;
	uint16_t cooling_current_value;
} GLVCurrRead_t;

//D3: ID_FCU_READINGS
typedef struct FCURead_t {
	uint16_t accelerator_pedal_raw_1;
	uint16_t accelerator_pedal_raw_2;
	uint16_t brake_pedal_raw;
	int16_t temperature;
} FCURead_t;

//D5: Battery Monitoring System Onboard Temps, BMS_ONB_TEMP
typedef struct BMSOnbTemp_t {
    int16_t average_temperature;
    int16_t low_temperature;
    int16_t high_temperature;
} BMSOnbTemp_t;

//D6: BMS Onboard Detailed Temps, BMS_ONB_DET_TEMP
typedef struct BMSOnbDetTemp_t {
	uint8_t ic_id;
    int16_t temperature_0;
    int16_t temperature_1;
} BMSOnbDetTemp_t;

//D7: BMS Voltages, BMS_VOLT
typedef struct BMSVolt_t {
    uint16_t average_voltage;
    uint16_t low_voltage;
    uint16_t high_voltage;
    uint16_t total_voltage;
} BMSVolt_t;

//D8: BMS Detailed Voltages, BMS_DET_VOLT
typedef struct BMSDetVolt_t {
	uint8_t ic_id_group_id;
    uint16_t voltage_0;
    uint16_t voltage_1;
    uint16_t voltage_2;
} BMSDetVolt_t;

//D9: BMS Temperatures, BMS_TEMP
typedef struct BMSTemp_t {
    int16_t average_temperature;
    int16_t low_temperature;
    int16_t high_temperature;
} BMSTemp_t;

//DA: BMS Detailed Temperatures, BMS_DET_TEMP
typedef struct BMSDetTemp_t {
	uint8_t ic_id;
    int16_t temperature_0;
    int16_t temperature_1;
    int16_t temperature_2;
} BMSDetTemp_t;

//DB: BMS Status, BMS_STAT
typedef struct BMSStat_t {
	uint8_t state;
    uint16_t error_flags;
    int16_t current;
    uint8_t flags;
} BMSStat_t;

//DC: FH Watchdog Test, FH_WATCHDOG_TEST
// ???

//DD: Charge Control Unit Status, CCU_STAT
typedef struct CCUStat_t {
    bool charger_enabled;
} CCUStat_t;

//DE: BMS Balancing Status, BMS_BAL_STAT
typedef struct BMSBalStat_t {
	uint8_t balancing_status[5];
} BMSBalStat_t;

//DF: FCU_ACCEL
typedef struct FCUAccel_t {
   uint8_t XValue_x100;
   uint8_t YValue_x100;
   uint8_t ZValue_x100;
} FCUAccel_t;

//E1: BMS_PARAM_RESP
// ???

//E2: BMS Coulomb Counts, BMS_COUL_COUNTS
typedef struct BMSCoulCounts_t {
    uint32_t total_charge;
    uint32_t total_discharge;
} BMSCoulCounts_t;

//E7: ID_ECU_GPS_READINGS_ALPHA
typedef struct MCUGpsAlpha_t {
    int32_t latitude;
    int32_t longitude;
} MCUGpsAlpha_t;

//E8: ID_ECU_GPS_READINGS_BETA
typedef struct MCUGpsBeta_t {
    int32_t altitude;
    int32_t speed;
} MCUGpsBeta_t;

//E9: MCU_GPS_READ_GAMMA
typedef struct MCUGpsGamma_t {
    uint8_t fix_quality;
    uint8_t satellite_count;
    uint32_t timestamp_seconds;
    uint16_t timestamp_milliseconds;
} MCUGpsGamma_t;

typedef struct telemMsg {
    //bool cobs_flag;
    uint32_t msg_id;
    uint8_t length;
    union {
        /* A0 */MCTemp1_t         mcTemp1;
        /* A1 */MCTemp2_t         mcTemp2;
        /* A2 */MCTemp3_t         mcTemp3;
        /* A3 */MCAInpVolt_t      mcAInpVolt;
        /* A4 */MCDInpStat_t      mcDInpStat;
        /* A5 */MCMotorPosInfo_t  mcMotorPosInfo;
        /* A6 */MCCurrInfo_t      mcCurrInfo;
        /* A7 */MCVoltInfo_t      mcVoltInfo;
        /* AA */MCIntStates_t     mcIntStates;
        /* AB */MCFaultCodes_t    mc_fault_codes;
        /* AC */MCTorTimerInfo_t  mcTorTimerInfo;
        /* AD */MCModIndexFluxWeakeningOutInfo_t
                mcModIndexFluxWeakeningOutInfo;
        /* AE */MCFirmInfo_t      mcFirmInfo;
        /* C0 */MCCommMsg_t       mcCommMsg;
        /* C1 */MCRWParamComm_t   mcRwParamComm;
        /* C2 */MCRWParamResp_t   mcRwParamResp;
        /* C3 */MCUStat_t         mcuStat;
        /* C4 */MCUPedalRead_t    mcuPedalRead;
        /* CC */GLVCurrRead_t     glvCurrRead;
        /* D3 */FCURead_t         fcuRead;
        /* D5 */BMSOnbTemp_t      bmsOnbTemp;
        /* D6 */BMSOnbDetTemp_t   bmsOnbDetTemp;
        /* D7 */BMSVolt_t         bmsVolt;
        /* D8 */BMSDetVolt_t      bmsDetVolt;
        /* D9 */BMSTemp_t         bmsTemp;
        /* DA */BMSDetTemp_t      bmsDetTemp;
        /* DB */BMSStat_t         bmsStat;
        /* DD */CCUStat_t         ccuStat;
        /* DE */BMSBalStat_t      bmsBalStat;
        /* DF */FCUAccel_t        fcuAccel;
        /* E2 */BMSCoulCounts_t   bmsCoulCounts;
        /* E7 */MCUGpsAlpha_t     mcuGpsAlpha;
        /* E8 */MCUGpsBeta_t      mcuGpsBeta;
        /* E9 */MCUGpsGamma_t     mcuGpsGamma;
    } contents;
    uint16_t checksum;
} telemMsg_t;

#pragma pack(pop)

#ifdef __cplusplus

// Relevant classes

//A0: Motor Controller Temperatur
class MC_temperatures_1 {
    public:
        MC_temperatures_1();
        MC_temperatures_1(uint8_t buf[8]);
        void load(uint8_t buf[8]);
        void write(uint8_t buf[8]);
        int16_t get_module_a_temperature();
        int16_t get_module_b_temperature();
        int16_t get_module_c_temperature();
        int16_t get_gate_driver_board_temperature();
    private:
        MCTemp1_t message;
};

//A1: Motor Controller Temperatures #2, MC_TEMP_2
class MC_temperatures_2 {
    public:
        MC_temperatures_2();
        MC_temperatures_2(uint8_t buf[8]);
        void load(uint8_t buf[8]);
        void write(uint8_t buf[8]);
        int16_t get_control_board_temperature();
        int16_t get_rtd_1_temperature();
        int16_t get_rtd_2_temperature();
